app/controllers/school_classes_controller.rb

    def create
        SchoolClass.create(school_class_params)
---
INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Software Engineering"], ["room_number", 10], ["created_at", "2018-12-20 18:13:12.824773"], ["updated_at", "2018-12-20 18:13:12.824773"]]

    def update
        school_class = SchoolClass.find(params[:id])
        school_class.update(school_class_params)
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "school_classes" SET "title" = ?, "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "Risk Analysis"], ["room_number", 10], ["updated_at", "2018-12-20 18:13:12.855575"], ["id", 1]]